In [5]:
import pandas as pd
import numpy as np
import os

In [2]:
df = pd.read_csv("python-ml-course-master/datasets/distributed-data/001.csv")

In [3]:
df.head()

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [4]:
df.shape

(1461, 4)

In [26]:
inputdir = "python-ml-course-master/datasets/distributed-data/"
i = 0
control = 0
for archivo in os.listdir(inputdir):
    if(i==0):
        df = pd.read_csv(inputdir+archivo)
        control = len(df)
    else:
        df_tmp = pd.read_csv(inputdir+archivo)
        control += len(df_tmp)
        df = pd.concat([df,df_tmp],axis=0)
    i += 1
if(control==len(df)):
    print("Se cargaron correctamete " + str(control) + " filas")
else:
    print("Chinga la madre!!")

Se cargaron correctamete 772087 filas

In [19]:
df.shape

(772087, 4)

In [20]:
df.tail()

           Date  sulfate  nitrate   ID
726  2004-12-27      NaN      NaN  332
727  2004-12-28      NaN      NaN  332
728  2004-12-29      NaN      NaN  332
729  2004-12-30      NaN      NaN  332
730  2004-12-31      NaN      NaN  332

In [21]:
df.head()

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [22]:
len(df)

772087